In [1]:
import numpy as np 
import pandas as pd

In [2]:
df = pd.DataFrame({'col1': [1,2,3,4],
                   'col2': [444, 555, 666, 444],
                   'col3': ['abc', 'def', 'ghi', 'xyz']})

In [3]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [7]:
df['col1'].unique() #getting unique values in col

array([1, 2, 3, 4], dtype=int64)

In [8]:
len(df['col1'].unique())

4

In [9]:
df['col1'].nunique()

4

In [11]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [12]:
df['col2'].nunique() #same as len()

3

In [13]:
df['col2'].value_counts() #getting how

444    2
666    1
555    1
Name: col2, dtype: int64

In [16]:
def times2(x):
    return x * 2

In [17]:
df['col2'].apply(times2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [18]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [20]:
df['col2'].apply(lambda x: x * 2) #quick without func

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [21]:
#pivot table

In [22]:
data = {'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
        'B': ['one', 'one', 'two', 'two', 'one', 'one'],
        'C': ['x', 'y', 'x', 'y', 'x', 'y'],
        'D': [1, 3, 2, 5, 4, 1]}

In [23]:
df = pd.DataFrame(data)

In [24]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [25]:
df.pivot_table(values='D', index=['A', 'B'], columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN